plantalog/cadi-gcl/stm32f100/grolly/current/main.c
#ifndef PAPA_EDITION
#define lcd_init_port_data			RCC_APB2Periph_GPIOB
#define lcd_init_port_cmd			RCC_APB2Periph_GPIOC
#define pin_e 					GPIO_Pin_10
#define pin_rw					GPIO_Pin_11
#define pin_rs					GPIO_Pin_12
#define lcd_port_data			GPIOB
#define lcd_port_cmd			GPIOC
#endif



#define Function_set 				0b00100000//4-bit,2 - line mode, 5*8 dots
#define Display_on_off_control		0b00001100/// display on,cursor off,blink off
#define Display_clear				0b00000001
#define Entry_mode_set				0b00000100//







u32 del;
static uint8_t		LCDLine1[16], LCDLine2[16];		// lcd frame buffer
uint8_t lcd_pointerx=0, lcd_pointery=0;


// DRIVER: Analog buttons
#define USE_BUTTONS
#ifdef USE_BUTTONS			// START BUTTONS DEFINITIONS
#define BUTTON_OK				2
#define BUTTON_CNL				3
#define BUTTON_BCK				1
#define BUTTON_FWD				4
#define BUTTON_RANGE_SHRINKER	30
uint16_t button_ranges[8];	// 0,2,4,6 - lower, 1,3,5,7 - higher values for buttons
uint8_t buttonReverse=0;
#endif						// EOF BUTTONS DEFINITIONS


#ifdef CADI_MB
#define JDR_BUTTONS	ADC1->JDR1		// continuous ADC channel for buttons
#define ADC_AVG_BUTTONS		0	// N=ADC_AVG_BUTTONS, for adcAverage[N]
#endif

#ifndef CADI_MB
#define ADC_AVG_BUTTONS		3
#define JDR_BUTTONS	ADC1->JDR4		// continuous ADC channel for buttons
#endif



// DRIVER:  RTC
#define USE_RTC
#ifdef USE_RTC				// START RTC DEFINITIONS
#define YEAR12SECS		1325462400	// vse raschety vedjom ot 01.01.2012
typedef struct
{
  unsigned char  hour;
  unsigned char  min;
  unsigned char  sec;
} RTC_Time;

typedef struct
{
  uint16_t  hour;
  uint16_t  min;
  uint16_t  sec;
  uint16_t  day;
  uint16_t  month;
  uint16_t  year;
  uint16_t  doy;	   //day of year

} RTC_DateTime;

RTC_Time toAdjust;
static uint8_t auto_flags=254;	// enable all except the 0 bit - psi stab
static uint8_t auto_failures=0;	// failure bits for corresponding auto programs' flags
static uint32_t timerStateFlags, cTimerStateFlags;
#endif						// EOF RTC DEFINITIONS


static uint32_t fup_time = 0;	// first time underpressure met
#define PSI_UNDERPRESSURE	650			// minimum pressure meaning there is water in pump, when it is running
#define PSI_UP_TIMEOUT	40				// seconds to stop PSI pump if underpressure met

// DRIVER: LOAD TRIGGERING
#define USE_LOADS
#ifdef USE_LOADS			// START LOADS DEFINITIONS
#define PLUG_DISABLE	GPIOC->BSRR
#define PLUG_ENABLE		GPIOC->BRR
#define	PLUG_INVERT		0		// enable reverse plugStateSet
#define PLUG_AMOUNT		4
//uint16_t plugStateFlags;	// not used due to regression (appeared 02.09.2014)
static uint16_t plugStateFlags2;	// this works ok
static uint8_t plugSettings[PLUG_AMOUNT] = {0, 1, 2, 3};	// PLUG_AMOUNT - number of plugs HARDCODE
// elementy massiva - nomera programm (ex "tajmerov"), sootvetstvujushih Plug'am.
// 0 element - pervyj plug, 1 element - plug no 2, etc
#endif						// EOF LOADS DEFINITIONS


// DRIVER: SD-card on SPI interface with FatFS
#define USE_SD
#ifdef USE_SD
	int no_sd=1;
	FATFS   fs;       // file system variable to mount SD card
	uint16_t logInterval=0;
#endif

/*
 *   =====  END OF DRIVER SECTION =====
 */

// CRITCAL VALUES defines
#define PSI_OVERPRESSURE	2700	// maximal pressure to shut down PSI pump
#define FWTANK_OVERLEVEL		15		// minimum distance to top for Fresh Water Tank
#define MIXTANK_OVERLEVEL		9		// same for Fertilizer Mixing Tank
#define MIXTANK_UNDERLEVEL	43		// maximum distance to top. if more, the mixing pump could fail


// define eeprom cells for keeping user settings. memory map
#define EE_PLUG_SETTINGS	0x05FF	//	each plug one value (16 plugs in total, range 7FF-809)
#define EE_TIMER1_ON		0x05DA	// for 4 timers 36 (hex=24) values (range: 7DA-7FF)
#define EE_CTIMER_DURATION	0x05C0	// 2 values for duration of cTimer.
#define EE_CTIMER_INTERVAL	0x05C2	// and 2 for interval. For 5 timers 25 (hex=19) values 7C0-7D9
#define EE_TIMER_SIZE		9
#define EE_CTIMER_SIZE		5
#define PH4_ADDR			0x0600
#define PH7_ADDR			0x0601
#define PH_INTERVAL			0x0602		// pH measurement interval in milliseconds
#define PH_BUFF_SIZE		0x0603		// pH buffer size
#define PH_WINDOW_TOP		0x0604		// pH window top adc value
#define PH_WINDOW_BOTTOM	0x0605	// pH window bottom adc value
#define SD_LOG_INTERVAL		0x0609		// sd logging interval, seconds
#define BUTTON_RANGES_START_ADDR	0x060A	// button ranges (8 values in a row) [60A-611]

#define EC1413_ADDR			0x0606
#define EC0_ADDR			0x067E	// after FMPs

#define RH_WINDOW_TOP		0x0607		// pH window top adc value
#define RH_WINDOW_BOTTOM	0x0608	// pH window bottom adc value

#define CIRCULATION_PUMP_ID_ADDR	0x0899		// seems not to be used due to overriding with timerId=70


//these defines configure abstract layer for accessing Cadi devices
// based on schematic picture used in Cadiweb panel
#define GROLLY
#ifdef GROLLY
#define PSI_PUMP_ID					0		// load ID for high pressure watering pump
#define FWTANK_SONAR					0
#define MIXTANK_SONAR					1
#define	WI_VALVE					0
#define FWI_VALVE					4
#define WLINE_61_VALVE				1
#define WLINE_62_VALVE				3
#define WLINE_63_VALVE				2
#define MIXING_PUMP					0		// doser MOSFET on T8
#endif




/*  === Watering programs ===
 *  Each WP runs at certain time, calculated as LAST_RUN+INTERVAL
 *  The execution is successfull, only when auto_flag for WP is enabled.
 *  The WP execution loop could be enabled and disabled according the 24H
 *  timer rule (WP_RULE_APPLIED>0)
 *
 */


// WATERING PROGRAMS SETTINGS ADRESSES
#define WP_AMOUNT					3		// 3x16=48(hex=30) values (range: 613-643)
#define WP_SIZE						11		// size of block of settings data of watering program
#define WP_OFFSET					0x0613	// watering program settings offset (first 8 bits of 16bit EEPROM value)
#define WP_RULES_APPLIED			1		// 24H timer and Full range timer rules (ids: 0..15 for each) [1.1 (8bits)]
#define	WP_VOLUME				1		// amount of water to be intaken for solution preparation (sonar units, 1..255) [1.2 (8bits)]
#define WP_INTERVAL			2		// 2x16bits for WP run interval (in seconds)
#define WP_START			4		// 2x16bit variables for program start time
#define WP_END			6		// after this time no triggering for this WP
#define WP_LAST_RUN_SHIFT			8		// 2x16bit last run of watering program
#define WP_FLAGS					10		// bit 0 (the last one): - WPEnabled flag

#define WP_INTAKE_TIMEOUT			600		// tieout in secs waiting until water fills the mixing tank through FWI valve


// 9x7=63 (hex=39) 0x0644 - 0x067D

#define FMP_PROGRAMS_AMOUNT			9

// Fertilizer Mixing Program adresses	()
#define FMP_OFFSET								0x0644
#define FMP_SIZE								7
#define FMP_DOSING_PUMP_ID_SHIFT				1
#define FMP_DOSING_TIME_SHIFT					2
#define FMP_CIRCULATION_MIXING_TIME_SHIFT		3
#define FMP_2_WP_ASSOC_SHIFT					4
#define FMP_TRIG_FREQUENCY_SHIFT				5
#define FMP_ENABLE								6

#define DOSER_SPEEDS			0x0612		// 4 bytes for doser speeds in percent (1..100)


#define COMM_MONITOR_MODE		48
#define COMM_GET_SETTINGS		49
#define COMM_SET_SETTINGS		50
#define COMM_DIRECT_DRIVE		51

