plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void autoSafe(void){
	if (((auto_flags&4)>>2)==1){
		// disale PSI pump in case of over pressure. PSI_OVERPRESSURE sets max
		if (adcAverage[AVG_ADC_PSI]>PSI_OVERPRESSURE) {
			plugStateSet(PSI_PUMP_ID,0);
		}

		// if while running PSI pump underpressure was constant during timeout, disable PSI pump
		vTaskDelay(1);
		uint32_t diff = RTC_GetCounter()-fup_time;
		if ((auto_flags&1)==1) {
			if (adcAverage[AVG_ADC_PSI]<PSI_UNDERPRESSURE){
				if (diff>PSI_UP_TIMEOUT) {
					plugStateSet(PSI_PUMP_ID, 0);	// disable psi pump
					auto_failures|=1;	// set PSI program failure flag
				}
				else {
					fup_time = RTC_GetCounter();
				}
			}
			else {
				fup_time = RTC_GetCounter();
			}
		}
		else {
			fup_time = RTC_GetCounter();
		}
/*		if ((auto_flags&1)==1 && adcAverage[AVG_ADC_PSI]<PSI_UNDERPRESSURE) {
			if (diff>PSI_UP_TIMEOUT) {
				plugStateSet(PSI_PUMP_ID, 0);
			}
		}
		else {
			fup_time = RTC_GetCounter();
		} */

		vTaskDelay(1);
		if (sonar_read[FWTANK_SONAR]<FWTANK_OVERLEVEL && sonar_read[FWTANK_SONAR]>0){
			close_valve(WI_VALVE);
		}
		vTaskDelay(1);
		if (sonar_read[MIXTANK_SONAR]<MIXTANK_OVERLEVEL && sonar_read[MIXTANK_SONAR]>0){
			close_valve(FWI_VALVE);
		}
		vTaskDelay(1);
		if (sonar_read[MIXTANK_SONAR]>MIXTANK_UNDERLEVEL){
			enable_dosing_pump(MIXING_PUMP,0);	// mixer pump off
		}
	}
	vTaskDelay(1);
}



void Lcd_write_8b(uint8_t tmp) {
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx++] = (tmp/100)+48;
	}
	else {
		LCDLine2[lcd_pointerx++] = (tmp/100)+48	;
	}
	Lcd_write_digit(tmp%100);

}

void calibrateFlowMeter(void){
	uint8_t button=0, valve=0, counter_id=0, volume=0;
	uint16_t ticks_in_10cl=0;
	uint32_t cnt_val1=0, cnt_val2=0;
	Lcd_clear();
	Lcd_write_str("Choose one:");
	vTaskDelay(500);

	while (button==0) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_16b(water_counter[0]);
		Lcd_write_str("2:");
		Lcd_write_16b(water_counter[1]);
		Lcd_goto(1,0);
		vTaskDelay(10);
		Lcd_write_str("3:");
		Lcd_write_16b(water_counter[2]);
		Lcd_write_str("4:");
		Lcd_write_16b(water_counter[3]);
	}
	Lcd_clear();
	counter_id = button-1;
	button=0;
	Lcd_write_str("Choose valve");
	valve = adjust8bit(valve);
	close_valve(valve);
	Lcd_clear();
	Lcd_write_str("How much x10CL?");
	volume = adjust8bit(volume);
	cnt_val1 = water_counter[counter_id];
	Lcd_clear();
	Lcd_write_str("OK to finish");
	open_valve(valve);
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(10);
		button=readButtons();
		Lcd_clear();
		Lcd_write_str("Current value:");
		Lcd_goto(1,0);
		Lcd_write_16b(water_counter[counter_id]);
	}
	cnt_val2 = water_counter[counter_id];
	close_valve(valve);
	vTaskDelay(200);

	ticks_in_10cl=(uint16_t)(cnt_val2-cnt_val1)/(uint16_t)volume;	// how much ticks for 10 CL?
	wfCalArray[counter_id] = ticks_in_10cl;	// ticks in 10cl
	Lcd_clear();
	Lcd_write_str("Ticks:");
	Lcd_write_16b(cnt_val2);
	Lcd_goto(1,0);
	Lcd_write_str("10CL=");
	Lcd_write_16b(ticks_in_10cl);
	EE_WriteVariable(WFM_CAL_OFFSET, ticks_in_10cl);
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(10);
		button=readButtons();
	}
	Lcd_clear();
	vTaskDelay(200);
}

void get_water_cl(uint8_t valve, uint8_t counter_id, uint16_t amount)
{
	uint32_t cnt_to_reach=0;
	cnt_to_reach = ((uint32_t)amount*(uint32_t)wfCalArray[0])/10;
//	uint8_t button=0;
	open_valve(0);		// HARDCODE
	water_counter[counter_id] = 0;
	while (water_counter[0]<cnt_to_reach) {
		vTaskDelay(10);
	}
	close_valve(0);		// HARDCODE
}

void get_water_tick(uint8_t valve, uint8_t counter_id, uint32_t ticks)
{
//	uint8_t button=0;
	open_valve(0);		// HARDCODE
	water_counter[counter_id] = 0;
	while (water_counter[0]<ticks) {
		vTaskDelay(10);
	}
	close_valve(0);		// HARDCODE
}

void get_water(uint8_t valve, uint8_t counter_id, uint16_t amount){	// amount in CL (10ml) max 65535x10=650L
	uint32_t cnt_to_reach=0;
	uint16_t volume=0;
	uint8_t button=0;
	Lcd_clear();
	Lcd_write_str("Calibrate WFM?");
	while (button==0) {
		vTaskDelay(10);
		button=readButtons();
	}
	if (button==BUTTON_OK) {
		calibrateFlowMeter();
	}


//	vTaskDelay(10000);
	uint8_t repeat=1;
	while (repeat==1) {
		Lcd_clear();
		Lcd_write_str("CL amount:");
		Lcd_write_16b(wfCalArray[0]);
		volume = adjust16bit_fast(volume, 5);
	//	cnt1=water_counter[0];
	//	cnt_to_reach = water_counter[0]+(volume*wfCalArray[0])/10;
		cnt_to_reach = ((uint32_t)volume*(uint32_t)wfCalArray[0])/10;

		Lcd_clear();
		Lcd_write_str("Adding");
		Lcd_write_16b((uint16_t)cnt_to_reach);
		Lcd_goto(1,0);
		Lcd_write_str("to ");
		Lcd_write_16b((uint16_t)water_counter[water_counter[counter_id]]);
		button=0;
		open_valve(0);		// HARDCODE
		water_counter[counter_id] = 0;
		while (water_counter[0]<cnt_to_reach) {
			vTaskDelay(10);
			Lcd_clear();
			Lcd_write_str("Cur:");
			Lcd_write_16b((uint16_t)water_counter[counter_id]);
			Lcd_goto(1,0);
			Lcd_write_str("of:");
			Lcd_write_16b(cnt_to_reach);
		}
		close_valve(0);		// HARDCODE
		Lcd_clear();
		Lcd_write_str("Repeat?");
		while (button==0) {
				vTaskDelay(10);
				button=readButtons();
		}
		if (button==BUTTON_OK) {
			repeat=1;
			water_counter[0]=0;
		}
		else {
			repeat=0;
		}
	}
}

void Lcd_write_16b(uint16_t tmp) {
	Lcd_write_digit((uint16_t)tmp/10000);
	Lcd_write_digit((uint16_t)(tmp%10000)/100);
	Lcd_write_digit((uint16_t)tmp%100);
}

uint8_t crc_block(uint8_t input, uint8_t *start_byte, uint8_t length){
	uint8_t i=0;
	for (i=0; i<length; i++) {
		input ^= start_byte[i];
	}
	return input;
}


void USART1_IRQHandler(void)
{

//	if (RxCounter>6) {
//			RxCounter=0;
//	}
	if (USART_GetITStatus(BT_USART, USART_IT_RXNE) != RESET) {
//			RxByte=(USART_ReceiveData(BT_USART) & 0x7F);
			RxByte = USART_ReceiveData(BT_USART);	// get byte from Data Register
#ifndef		PRODUCTION_BUILD
			RxBuffer[RxCounter++] = RxByte;			// write it into RxBuffer
#endif
			USART1->SR &= ~USART_FLAG_RXNE;			// clear Rx Not Empty flag
	}
	BT_USART->SR &= ~USART_SR_TC;

	// sending packet in case of Tx Not Empty flag is set and buffer not sent completely yet
	if (txbuff_ne==1 && TxCounter<NbrOfDataToTransfer) {
		USART1->DR = TxBuffer[TxCounter++];	// write TxBuff byte into Data Register for sending
		USART1->SR &= ~USART_SR_TC;		// clear Transfer Complete flag
	}

	if (packet_ready==0) {
		if (rxm_state==RXM_CMD) {
			if (pb_pntr==0) {	// if packet buffer pointer is 0, it points to payload size (payload, including this size byte)
				packet_length=RxByte;	// get packet length
			}
			RxBuffer[pb_pntr++]=RxByte;	// receive byte into cmd buffer and increase command packet buffer pointer
			if (pb_pntr==(packet_length+1)) {	// if packet buffer pointer reached packet length (rely on RXM_NONE set later)
				// crc count
				rx_packet_crc = crc_block(48, &RxBuffer[0],packet_length);	// 48 is XOR of "ZX2", -1 for skipping cmd id resp
				// crc check
				if (rx_packet_crc==0) {	//
					packet_ready=1;	// packet received correctly and is ready to process
				}
				else {
					rx_flush();	// discard broken packet
				}
				rxm_state=RXM_NONE; // RX machine state set to NONE, completes RX cycle
				pb_pntr=0;			// packet buffer pointer to 0
				prefixDetectionIdx = 0;
			}
		}
		/* if (rxm_state==RXM_SET) {
				if (pb_pntr==0) {	// if packet buffer pointer is 0, it points to payload size (payload, including this size byte)
					packet_length=RxByte;	// get packet length
				}
				RxBuffer[pb_pntr++]=RxByte;	// receive byte into cmd buffer and increase command packet buffer pointer
				if (pb_pntr==packet_length) {	// if packet buffer pointer reached packet length (rely on RXM_NONE set later)
					// crc count
					rx_packet_crc = crc_block(48, &RxBuffer[0],packet_length);	// 48 is XOR of "ZX2"
					// crc check
					if (rx_packet_crc==0) {
						packet_ready=1;	// packet received correctly and is ready to process
					}
					else {
						rx_flush();	// discard broken packet
					}
					rxm_state=RXM_NONE; // RX machine state set to NONE, completes RX cycle
					pb_pntr=0;			// packet buffer pointer to 0

