plantalog/cadi-gcl/stm32f100/grolly/current/main.c
				}

		}  */



		if (RxByte==90) {
			// ready
			prefixDetectionIdx = 1;
		}
		else if (RxByte==88 && prefixDetectionIdx==1) {
			// steady
			prefixDetectionIdx = 2;
		}
		else if (prefixDetectionIdx==2) {
			if (RxByte==48) {
				// escaping zero
			}
			else if (RxByte==49){
				// settings
				rxm_state=RXM_SET;
			}
			else if (RxByte==50) {
				// command
				rxm_state=RXM_CMD;
				rx_flush();
				pb_pntr=0;	// packet buffer pointer to zero to start reading new payload
			}
			prefixDetectionIdx = 0;
		}
	}
}

void save_settings(void){	// wrapper for rx_ee, simplifies settings packet receiving
	if (RxBuffer[0]==5) {		// 16 bit (5: size(1b), addr(2b), data(2b))
		rx_ee((RxBuffer[2]&(RxBuffer[3]<<8)), 1);
	}
	if (RxBuffer[0]==7) {		// 32 bit (7: size(1b), addr(2b), data(4b))
		rx_ee((RxBuffer[2]&(RxBuffer[3]<<8)), 2);
	}
}

/* static void uart_task(void *pvParameters){
	while (1) {
		if (packet_ready==1) {
			if (rxm_state == RXM_CMD) {
				run_uart_cmd();	// when
			}
			if (rxm_state == RXM_SET) {
				save_settings();
			}
			packet_ready=0;
		}
		vTaskDelay(10);
		if (txbuff_ne==1) {	// if TxBuff is not empty (flag set by, for example, get_settings_block())
			send_packet();	// send packet from TxBuff
		}
		vTaskDelay(10);
	}
} */

static void uart_task(void *pvParameters){
	while (1) {
		if (packet_ready==1) {
			run_uart_cmd();	// when command packet received, run the command
			if (RxBuffer[1]<50) {	// other than get_status_block()
				send_resp(RxBuffer[RxBuffer[0]]);		// send cmd id recently run, to confirm execution
				rx_flush();
				pb_pntr=0;
			}
			packet_ready=0;
		}
		vTaskDelay(10);
		// if (txbuff_ne==1) {	// if TxBuff is not empty (flag set by, for example, get_settings_block())
		//	send_packet();	// send packet from TxBuff
		// }
	}
}


void send_packet(){
	// wrap packet
}

void rx_flush(void){
	uint8_t i=0;
	for (i=0; i<42; i++){		/// HARDCODE
		RxBuffer[i] = 0;
	}
}

void tx_flush(void){
	uint8_t i=0;
	NbrOfDataToTransfer = 0;
	for (i=0; i<42; i++){		// HARDCODE
		TxBuffer[i] = 0;
		vTaskDelay(1);
	}
}

void send_resp(uint8_t cmd_uid){
	TxBuffer[0] = 90;	// "Z"
	TxBuffer[1] = 88;	// "X"
	TxBuffer[2] = 55;	// "7" command execution success response packet
	TxBuffer[3] = 5;	// packet size
	TxBuffer[4] = cmd_uid;
	TxBuffer[5] = crc_block(0, &TxBuffer[0],(TxBuffer[3]));	// with crc
	vTaskDelay(1);
	NbrOfDataToTransfer = TxBuffer[3]+1;	// packet size with cmd id
	TxCounter=0;							// reset tx buffer pointer
	txbuff_ne=1;
	while (TxCounter<NbrOfDataToTransfer){
		vTaskDelay(3);
	}
	tx_flush();
	txbuff_ne=0;	// packet sent, reset tx not empty flag
}

void run_uart_cmd(void){
	uint16_t addr = 0;
	switch (RxBuffer[1]) {
		// below 50 there are tasks that send responsewhen successfully executed
		case 0:
			get_water_cl(RxBuffer[2],RxBuffer[3],RxBuffer[4]*256+RxBuffer[5]);
			break;
		case 1:
			plugStateSet(RxBuffer[2], RxBuffer[3]);
			break;
		case 2:
			comm_state=COMM_DIRECT_DRIVE;
			plugStateSet(PSI_PUMP_ID, 0);	// disables PSI pump when entered CDD mode
			break;
		case 3:
			comm_state=COMM_MONITOR_MODE;
			break;
		case 4:
			open_valve(RxBuffer[2]);
			break;
		case 5:
			close_valve(RxBuffer[2]);
			break;
		case 6:
			get_settings_block(RxBuffer[2]);
			break;
		case 8:
			if (comm_state==COMM_DIRECT_DRIVE) {
				auto_flags=RxBuffer[2];	// set auto-processing flags
			}
			break;
		case 9:
//			enable_dosing_pump(RxBuffer[2], RxBuffer[3]);
			run_doser_for(RxBuffer[2], RxBuffer[3], RxBuffer[4]);
			break;
		case 10:
			valve_failed = RxBuffer[2];
			fup_time=RTC_GetCounter();
			auto_failures=0;
			break;
		case 11:	// stop all processes and force manual control
			auto_flags=0;
			comm_state=COMM_DIRECT_DRIVE;
			auto_flags = 0;
			plugStateSet(0,0);
			plugStateSet(1,0);
			plugStateSet(2,0);
			plugStateSet(3,0);
			close_valve(2);
			close_valve(3);
			close_valve(0);
			close_valve(1);
			break;
		case 12:
			RTC_SetCounter(RxBuffer[2]*16777216+RxBuffer[3]*65536+RxBuffer[4]*256+RxBuffer[5]);
			break;
		case 13:
			NVIC_SystemReset();
			break;
		case 14:
			get_fertilizer(RxBuffer[2], RxBuffer[3]);
			break;
		case 15:	// receive 16 bit value to store into EEPROM
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			rx_ee(addr, 1);
			break;
		case 16:	// receive 32byte block to store into EEPROM
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			rx_ee(addr, 16);
			break;
		case 19:
			loadSettings();
			break;
		case 20:
			valve_busy=0;
			break;
		case 21:
//			wp_next_run(RxBuffer[2](RxBuffer[3]+(RxBuffer[4]<<8)+(RxBuffer[5]<<16)+(RxBuffer[6]<<24)));
			break;



			// the ones not needed to send additional confirmation response
		case 51:
			get_status_block(RxBuffer[2]);
			break;
		case 56:	// receive 32 bit value to store into EEPROM
			rx_ee((RxBuffer[2]&(RxBuffer[3]<<8)), 2);
			break;
		case 57:	// send 16 bit EEPROM value
			send_ee_addr((RxBuffer[2]+RxBuffer[3]*256), 1);
			break;
		case 58:	// send 32 bit EEPROM value
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			send_ee_addr(addr, 2);
			break;
		case 59:	// send block of EEPROM values
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			send_ee_block(addr);
			break;
	}
//	rx_flush();
}


void wp_next_run(uint8_t wp_id, uint32_t time){
	// setting the last run
}

// adds 'amount' seconds of fertilizer using pump with ID	 = pump_id
void run_doser_for(uint8_t pump_id, uint8_t amount, uint8_t speed){
	uint32_t finish = 0, now = 0;
	now = RTC_GetCounter();
	finish = now+amount;
	enable_dosing_pump(pump_id, speed);
	while (now<finish) {
		now = RTC_GetCounter();
		vTaskDelay(2);
		get_status_block(1);	// send status blocks
		vTaskDelay(2);
	}
	enable_dosing_pump(pump_id, 0);
}

void rx_ee(uint16_t addr, uint8_t type){
	//addr=(RxBuffer[2]+RxBuffer[3]*256);
	uint32_t val32 = 0;
	static uint16_t val16 = 0;
	uint8_t i=0;
	if (type==1) {	// 2 bytes
		val16=(RxBuffer[4]+(RxBuffer[5]*256));
		EE_WriteVariable(addr,val16);
	}
	if (type==2) {	// 4 bytes
		val32=(RxBuffer[4]+(RxBuffer[5]*256)+(RxBuffer[6]*65536)+(RxBuffer[7]*16777216));
		EE_WriteWord(addr,val32);
	}
	if (type==16){	// 32 bytes block
		for (i=0;i<32;i++){
			val16=0;
			val16=((uint16_t)RxBuffer[(4+i*2)]+(uint16_t)RxBuffer[(5+i*2)*256]);
			EE_WriteVariable(addr++,val16);
			vTaskDelay(1);
		}
	}
}


