plantalog/cadi-gcl/stm32f100/grolly/current/main.c
			if (button==BUTTON_FWD){
						open_valve(1);
			}
			if (button==BUTTON_BCK){
					close_valve(1);
			}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_digit(valveFlags);
		Lcd_write_str("VS");
		uint16_t val=0;
		val = VALVE_SENSOR_PORT->IDR>>5;
		Lcd_write_16b(val);
		Lcd_write_str(" ");

		vTaskDelay(1);
		if (VALVE_SENSOR_PORT->IDR>>5 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>6 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>7 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
#endif

		Lcd_write_str("W");

	}
	eeprom_test();
	Lcd_clear();
	valve_test2();
	valve_test3();
}




#define WP_AMOUNT					3		// 3x16=48(hex=30) values (range: 613-643)
#define WP_SIZE						11		// size of block of settings data of watering program
#define WP_OFFSET					0x0613	// watering program settings offset (first 8 bits of 16bit EEPROM value)
#define WP_RULES_APPLIED			1		// 24H timer and Full range timer rules (ids: 0..15 for each) [1.1 (8bits)]
#define	WP_VOLUME				1		// amount of water to be intaken for solution preparation (sonar units, 1..255) [1.2 (8bits)]
#define WP_INTERVAL			2		// 2x16bits for WP run interval (in seconds)
#define WP_START					4		// 2x16bit variables for program start time
#define WP_END						6		// after this time no triggering for this WP
#define WP_LAST_RUN_SHIFT			8		// 2x16bit last run of watering program
#define WP_FLAGS					10

uint16_t adjustFlags(uint16_t flags, uint8_t from, uint8_t to){
	uint8_t i=0;
	uint8_t button=0, cursor=0;
	uint8_t var=0;
	var = (flags>>from);
	Lcd_goto(0,0);
	Lcd_write_str("_");
	while (button!=BUTTON_OK) {
		button=readButtons();
		Lcd_goto(1,0);
		for (i=0;i<(to-from);i++) {
			if ((var>>i)&1==0){
				Lcd_write_str("0");
			}
			else {
				Lcd_write_str("1");
			}
		}
		vTaskDelay(1);
		for (i=0;i<(to-from);i++) {
			Lcd_goto(0,0);
			Lcd_write_str(" ");
		}
		Lcd_goto(0, cursor);
		Lcd_write_str("_");
		vTaskDelay(5);
		if (button==BUTTON_FWD && cursor<(to-from)) {
			cursor++;
		}
		if (button==BUTTON_BCK && cursor>0) {
			cursor--;
		}
		if (button==BUTTON_CNL){
			// invert current cursor positioned bit
			var ^= (1 << cursor);
		}
	}
	// put temporary var back into flags
	for (i=0; i<(to-from); i++) {
		if ((var>>i)&1==1) {
			flags|=(1<i+from);	// set bit
		}
		else {
			flags &= ~(1<<(i+from)); // reset bit
		}
	}
	printOk();
	return flags;
}

void water_program_setup(uint8_t progId){
	uint16_t addr=0, volume=0, flags=0;
	uint32_t time=0;

	// setting water volume
	Lcd_clear();
	Lcd_write_str("Volume");		// in sonar distance units
	vTaskDelay(200);
	addr = WP_OFFSET+progId*WP_SIZE+WP_VOLUME;
	EE_ReadVariable(addr, &volume);
	volume = (uint16_t)adjust8bit(volume);
	EE_WriteVariable(addr, volume);

	// setting watering lines valves to open
	Lcd_clear();
	Lcd_goto(0,5);
	Lcd_write_str("ON VALVES");		// in sonar distance units
	vTaskDelay(200);
	addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
	EE_ReadVariable(addr, &flags);
	flags = adjustFlags(flags,0,3);
	uint8_t button=0, flag = 0;
	while (button==0) {
		button=readButtons();
		if (button==BUTTON_FWD){
			flag = 1 - flag;
		}
		vTaskDelay(25);
	}
	if (flag==1) {
		flags|=1;	// set bit
	}
	else {
		flags &= ~1; // reset bit
	}
	EE_WriteVariable(addr, flags);
	vTaskDelay(5);
	printOk();

	// adjust start time
	uint32_t ts=0;		// timestamp unixtime
	addr = WP_OFFSET+progId*WP_SIZE+WP_START;
	ts = EE_ReadWord(addr);
	ts = timeAdjust(ts,1);
	EE_WriteVariable(addr, ts);

	// adjust end time
	addr = WP_OFFSET+progId*WP_SIZE+WP_END;
	ts = EE_ReadWord(addr);
	ts = timeAdjust(ts,1);
	EE_WriteVariable(addr, ts);

	// adjust interval
	addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
	ts = EE_ReadWord(addr);
	ts = CTimerAdjust(ts);
	EE_WriteWord(addr, ts);

}

/*
void water_program_setup2(uint8_t progId){
	uint16_t addr=0, tempvalue=0;
	uint32_t tmp32, interval;

	// set fresh water fill timeout, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtr fill timeout");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);



	// set watering timeout, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_WTRNG_TIMEOUT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtrng timeout");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering duration, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
	interval = EE_ReadWord(addr);
	Lcd_clear();
	Lcd_write_str("Set run interval");
	vTaskDelay(500);
	interval = CTimerAdjust(interval);
	EE_WriteWord(addr, interval);


	// enable watering program (=1 enables the WP)
	addr = WP_OFFSET+progId*WP_SIZE+WP_ENABLE_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Enable WP?");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

//	EE_ReadWord(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Start program?");
	uint8_t button=0;
	while (button==0) {
		button=readButtons();
		vTaskDelay(10);
	}
	if (button==BUTTON_OK) {
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	if (button==BUTTON_CNL) {
		Lcd_clear();
		Lcd_write_str("Start time");
		vTaskDelay(1000);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START;
		tmp32 = EE_ReadWord(addr);
		tmp32 = timeAdjust(tmp32, 1);
		EE_WriteWord(addr, tmp32);
	}
	Lcd_clear();
	Lcd_write_str("End time");
	vTaskDelay(1000);
	addr = WP_OFFSET+progId*WP_SIZE+WP_END;
	tmp32 = EE_ReadWord(addr);
	tmp32 = timeAdjust(tmp32, 1);
	EE_WriteWord(addr, tmp32);
	Lcd_clear();
	vTaskDelay(200);

	vTaskSuspendAll();
	loadSettings();
	xTaskResumeAll();

