plantalog/cadi-gcl/stm32f100/grolly/current/main.c
}
*/

void fertilization_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	fertilizer_mixing_program_setup(progId);
}

void watering_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	water_program_setup(progId);
}

// set fertilizer mixing programs
void fertilizer_mixing_program_setup(uint8_t progId){
	uint16_t addr=0, tempvalue=0;

	// choose dosing pump to use
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Fertilizer 2 use");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set dosing time, seconds
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Dosing duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump mixing time
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Aftermix time");		// setting the time for running circulation pump to mix the fertilizer into solution
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering program to associate this fertilizer mix program with
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Link to WP");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set frequency (N), showing how often this fertilizer mixing program activates (every N watering program run)
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Trig. freq. N");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set ENABLED/DISABLED status for this program
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_ENABLE;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("ENABLE FMP?");
	tempvalue = adjust16bit(tempvalue);
	vTaskDelay(10);
	EE_WriteVariable(addr, tempvalue);
	Lcd_clear();
	vTaskDelay(10);
	loadSettings();
}

void startWp(void){
	uint8_t progId=0, button=0;
	uint32_t addr, tmp32, interval;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	Lcd_clear();
	Lcd_write_str("Start WP#");
	Lcd_write_digit(progId);
	Lcd_write_str("?");
	while (button!=BUTTON_OK && button!=BUTTON_CNL) {
//		dht_get_data();
		vTaskDelay(30);
		button=readButtons();
	}
	vTaskDelay(200);
	if (button==BUTTON_OK) {
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
		interval = EE_ReadWord(addr);
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	Lcd_clear();
	vTaskDelay(200);
}



void run_watering_program(uint8_t progId){
/*	wpStateFlags|=(1<<progId);	// set active flag for this program
	close_valve(DRAIN_VALVE_ID);	// close drain valve
//	valveFlags=0;	// all valves to off;
	uint16_t addr, sensorId, fmpLink, wateringPlugId=0;
	uint8_t i, waterSensorFlag=0;
	uint32_t now=0, end=0, wateringDuration=0, lastTime=0;
	vTaskDelay(1);
/*
	//r1 = 45;	// 40..45 depending on water level. top 45^2 = 2025
	uint8_t r2top = 45;
	uint8_t r1 = 40;	// bottom	40^2 = 1600

	uint8_t h = (btm_lvl-cur_lvl);
	uint32_t r2 = r1+((r2top-r1)*100*h/(btm_lvl-top_lvl))/100;
	// V = 1/3(pi*h*(r1^2+r1*r2+r2^2))
	// h = (3*V)/(pi*(r1^2+r1*r2+r2^2))
	// h = (3*10)
	uint32_t cur_vol = (3142*h*(r1^2+r1*r2+r2^2)/1000)/3;


	// count the cm-s we need to get +
	uint16_t height = 3*vol/((3.142*(r1*r1+r1*r2+r2*r2)));
*/

	wpStateFlags|=(1<<progId);	// set active flag for this program
	uint32_t wpStartTs = 0;
	wpStartTs = RTC_GetCounter();
	// FRESH WATER INTAKE
	open_valve(FWI_VALVE);	// FWI valve
	uint16_t n=0;
	uint8_t i=0;
	uint32_t curN=0, interval=0, startime=0, now=0, end=0;
	uint16_t volume = 0, addr=0, fmpLink=0, flags=0;
	addr = WP_OFFSET+progId*WP_SIZE+WP_VOLUME;
	EE_ReadVariable(addr, &volume);
	volume = sonar_read[MIXTANK_SONAR]-(volume & (0xFF));	// count the sonar value to expect
	now = RTC_GetCounter();
	end = now + WP_INTAKE_TIMEOUT;
	while (sonar_read[MIXTANK_SONAR]>volume && now<end) {
		now = RTC_GetCounter();
		vTaskDelay(25);
	}
	close_valve(FWI_VALVE);
	vTaskDelay(1000);



	// mix fertilizers
	for (i=0; i<FMP_PROGRAMS_AMOUNT; i++) {

		// count current N value
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
		interval = EE_ReadWord(addr);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START;
		startime = EE_ReadWord(addr);
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
		EE_ReadVariable(addr, &n);
		curN = (RTC_GetCounter()-startime)/interval;
		uint8_t rest = curN/n;

		uint16_t enabled=0;
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
		EE_ReadVariable(addr, &fmpLink);
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_ENABLE;
		EE_ReadVariable(addr, &enabled);
		if (fmpLink==progId && enabled==1 && rest==0) {
			run_fertilizer_mixer(i);
		}
		vTaskDelay(10);
	}

	// open corresponding watering line valve(s)
	addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
	EE_ReadVariable(addr, &flags);
	for (i=1; i<(VALVE_AMOUNT+1); i++) {
		if (((flags>>i)&1)==1) {
			open_valve(i);
		}
		else {
			close_valve(i);
		}
		vTaskDelay(1);
	}

	// run watering
	auto_flags|=1;	// enable watering through psi stab function
	uint8_t srcomm = 0;
	srcomm = comm_state;	// backup curent commstate. to recover after watering
	comm_state = COMM_MONITOR_MODE;
	while (now<end && (auto_failures&1)==0) {
		vTaskDelay(5);
	}
	auto_flags&=~(1);	// disable PSI stab function flag
	comm_state = srcomm;	// recover comm_state
	auto_failures  &= ~1;	// reset PSI failure flag
	plugStateSet(PSI_PUMP_ID, 0);	// force disable PSI pump

	vTaskDelay(10);
	valve_init();	// close all valves

