plantalog/cadi-gcl/stm32f100/grolly/current/main.c
	addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
	EE_WriteWord(addr, wpStartTs);	// write last run time

	wpStateFlags &= ~(1<<progId); // sbrosit' flag
	vTaskDelay(200);



}

/* void run_watering_program_hptl(uint8_t progId){
	wpStateFlags|=(1<<progId);	// set active flag for this program

	plugStateSet(3,0);	// close drain valve
	uint16_t addr, solutionVolume=0, fmpLink, wateringPlugId=0;
	uint8_t i, tank4lvl=0;
	uint32_t now=0, end=0, wateringDuration=0, lastTime=0;
	vTaskDelay(1);

	addr = WP_OFFSET+progId*WP_SIZE+WP_SOLUTION_VOLUME_SHOFT;
	EE_ReadVariable(addr, &solutionVolume);

	// water fill timeout
	addr = WP_OFFSET+progId*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
	EE_ReadVariable(addr, &wateringDuration);

	now = RTC_GetCounter();
	end = now + wateringDuration;

	vTaskDelay(5);


	// fill the tank
	open_valve(FWI_VALVE);	// open Fresh Water Intake (FWI) valve
	// and keep it open until the water reaches the volume set or timeout exceeds
	while (sonar_read[MIXTANK_SONAR]<solutionVolume || now<end) {
		now = RTC_GetCounter();
		vTaskDelay(25);
	}
	close_valve(FWI_VALVE);
	vTaskDelay(1000);


	// mix fertilizers
	for (i=0; i<FMP_PROGRAMS_AMOUNT; i++) {
		// count current N value
		uint16_t n=0;
		uint32_t curN=0, interval=0, startime=0;
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
		interval = EE_ReadWord(addr);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START;
		startime = EE_ReadWord(addr);
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
		EE_ReadVariable(addr, &n);
		curN = (RTC_GetCounter()-startime)/interval;
		uint8_t rest = curN/n;

		uint16_t enabled=0;
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
		EE_ReadVariable(addr, &fmpLink);
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_ENABLE;
		EE_ReadVariable(addr, &enabled);
		if (fmpLink==progId && enabled==1 && rest==0) {
			run_fertilizer_mixer(i);
		}
		vTaskDelay(10);
	}

	// run watering
	addr = WP_OFFSET+progId*WP_SIZE+WP_DURATION_SHIFT;
	EE_ReadVariable(addr, &wateringDuration);

	addr = WP_OFFSET+progId*WP_SIZE+WP_WATERING_PUMP_PLUG_ID;
	EE_ReadVariable(addr, &wateringPlugId);

	vTaskDelay(10);
//	now=0;
	now = RTC_GetCounter();
	end = RTC_GetCounter() + wateringDuration;
	vTaskDelay(10);

	open_valve(WLINE_61_VALVE);
#define WLINE_62_VALVE				3
	i=0;
	auto_flags |= 1;	// enable PSI level keeper
	while (now<end && ((wpStateFlags>>progId)&1)) {
		vTaskDelay(10);
		i=cTimerStateFlags&1;	// HARDCODE!!! (used CTimer0) apply CTimer to split watering into periods
		if ((lastTime<RTC_GetCounter()) && i==1 && waterSensorFlag==1) {
			now++;
			lastTime=RTC_GetCounter();
		}
		vTaskDelay(5);
	}
	auto_flags &= ~1;	// disable PSI level keeper
	plugStateSet(wateringPlugId, 0);
	// drain the rest of the tank

	vTaskDelay(10);
	close_valve(DRAIN_VALVE_ID);
	open_valve(DRAIN_VALVE_ID);

	addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
	EE_WriteWord(addr, RTC_GetCounter());	// write last run time

	wpStateFlags &= ~(1<<progId); // sbrosit' flag
	vTaskDelay(200);
} */

void run_fertilizer_mixer(uint8_t progId){
	uint16_t dosingTime, dosingPumpId, circulationMixingTime, addr;
	uint32_t dosingEndTime=0;

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &dosingTime);

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &dosingPumpId);

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &circulationMixingTime);

	dosingEndTime = RTC_GetCounter()+dosingTime;
	enable_dosing_pump(dosingPumpId, 1);
	while (RTC_GetCounter()<dosingEndTime) {
		vTaskDelay(10);
	}
	enable_dosing_pump(dosingPumpId, 0);
	run_circulation_pump(circulationMixingTime);
}

void run_circulation_pump(uint16_t time){
	uint32_t endTime=0;
	endTime = RTC_GetCounter()+time;
	enable_dosing_pump(MIXING_PUMP,1);	// Grolly has Mixing pump connected to T8 MOSFET of Cadi MB 1402
	while (RTC_GetCounter()<endTime) {
		vTaskDelay(10);
	}
	enable_dosing_pump(MIXING_PUMP,0);
}


void enable_dosing_pump2(uint8_t pumpId, uint8_t state){
	if (state==1) {
		dosingPumpStateFlags |= (1<<pumpId);
	}
	else {
		dosingPumpStateFlags &= ~(1<<pumpId);
	}

	state = 1-state;	// 0% pwm means running motor

	if (pumpId==0) {
		TIM3->CCR1 = state*1000;
	}
	if (pumpId==1) {
		TIM3->CCR2 = state*1000;
	}
	if (pumpId==2) {
		TIM3->CCR3 = state*1000;
	}
	if (pumpId==3) {
		TIM3->CCR4 = state*1000;
	}
}

void enable_dosing_pump(uint8_t pumpId, uint8_t state){
//	uint8_t prcnt = 0;
	if (state>0) {
		dosingPumpStateFlags2 |= (1<<pumpId);
	}
	else {
		dosingPumpStateFlags2 &= ~(1<<pumpId);
	}

	if (state==1) {
		state = 0;
	}
	else {
		state = 100 - state;	// 0 - running motor, 100 - stopped
	}

	if (pumpId==0) {
		TIM3->CCR1 = state*10;
	}
	if (pumpId==1) {
		TIM3->CCR2 = state*10;
	}
	if (pumpId==2) {
		TIM3->CCR3 = state*10;
	}
	if (pumpId==3) {
		TIM3->CCR4 = state*10;
	}
}

void get_fertilizer(uint8_t fertId, uint8_t secs){	// secs - number of seconds to run the fertId pump
	uint32_t reach = 0;
	// to make counting more precise wait until the next second STARTS
	reach = RTC_GetCounter()+1;
	while (RTC_GetCounter()<reach) {
		vTaskDelay(2);
	}
	reach = RTC_GetCounter()+secs;
	enable_dosing_pump(fertId,1);	// enable dosing pump
	while (RTC_GetCounter()<reach) {	// now dose the fertilizer withi 'secs' seconds
		vTaskDelay(2);		//
	}
	enable_dosing_pump(fertId,0);
}

void valve_init(void){
	close_valve(3);
	close_valve(4);
	close_valve(0);
	close_valve(1);
}

void watering_program_trigger(void *pvParameters){
	uint32_t curtime, lastRun, interval, diff, startTime, endTime;
	uint16_t addr;
	uint8_t wpStateFlag=0, progId, enabled;
	// reinit valves
	valve_init();

	while (1) {
//

		// additional low speed tasks
		tankLevelStab();
		autoSafe();
		sonar_ping();

		// main loop
		for (progId=0; progId<WP_AMOUNT; progId++){
			vTaskDelay(10);
			addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
			lastRun = EE_ReadWord(addr);
			curtime = RTC_GetCounter();
			addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
			interval = EE_ReadWord(addr);
			diff = curtime-lastRun;
			addr = WP_OFFSET+progId*WP_SIZE+WP_START;
			startTime = EE_ReadWord(addr);	// program start time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_END;
			endTime = EE_ReadWord(addr);	// program end time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
			EE_ReadVariable(addr, &enabled);	// program start time point
			vTaskDelay(10);
//			wpStateFlag=wpStateFlags&(1<<progId);	// check if WP active now
//			wpStateFlag>>=progId;	// ostavit' toka flag
			if (diff>interval && curtime>startTime && curtime<endTime && enabled>0){
				run_watering_program(progId);
			}
			vTaskDelay(10);
		}
	}

