plantalog/cadi-gcl/stm32f100/grolly/current/main.c
}




void dht_init(void){
	// RCC Config
	  /* TIM15 clock enable */
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM15, ENABLE);

	  // GPIO Config
	  GPIO_InitTypeDef GPIO_InitStructure;

	  /* TIM15 channel 2 pin (PB15) configuration */
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	// NVIC Config

	  GPIO_PinRemapConfig(GPIO_Remap_TIM15, ENABLE);
	  NVIC_InitTypeDef NVIC_InitStructure;

	   /* Enable the TIM15 global Interrupt */

	  NVIC_InitStructure.NVIC_IRQChannel = TIM1_BRK_TIM15_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);

	   TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	   TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	   TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	   TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	   TIM_ICInitStructure.TIM_ICFilter = 0x0;

	   TIM_PWMIConfig(TIM15, &TIM_ICInitStructure);

	   /* Select the TIM15 Input Trigger: TI2FP2 */
	   TIM_SelectInputTrigger(TIM15, TIM_TS_TI2FP2);

	   /* Select the slave Mode: Reset Mode */
	   TIM_SelectSlaveMode(TIM15, TIM_SlaveMode_Reset);

	   /* Enable the Master/Slave Mode */
	   TIM_SelectMasterSlaveMode(TIM15, TIM_MasterSlaveMode_Enable);

	   /* TIM enable counter */
	   TIM_Cmd(TIM15, ENABLE);

	   /* Enable the CC2 Interrupt Request */
	   TIM_ITConfig(TIM15, TIM_IT_CC2, ENABLE);

}

void dht_init_out(void){	// init GPIO pin as OUTput
	 GPIOB->CRH      &= ~GPIO_CRH_CNF15;		// ... and PB15 for DHT triggering
     GPIOB->CRH   |= GPIO_CRH_MODE15_0;
}

/******************************************************************************/
/*            STM32F10x Peripherals Interrupt Handlers                        */
/******************************************************************************/

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM_GetCapture2(TIM3);

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = (TIM_GetCapture1(TIM3) * 100) / IC2Value;

    /* Frequency computation */
    Frequency = SystemCoreClock / IC2Value;
  }
  else
  {
    DutyCycle = 0;
    Frequency = 0;
  }
  dht_bit_position++;		// holds current DHT response bit sequence number

	if (dht_bit_position>dht_shifter && dht_data_ready==0) {
		if (DutyCycle>25 && DutyCycle<35) {
			dht_data[dht_byte_pointer] &= ~(1<<(dht_bit_pointer));	// reset bit in dht_data[i]
		}
		else {
			dht_data[dht_byte_pointer] |= (1<<(dht_bit_pointer)); // set bit
		}
		if (dht_bit_pointer==0){
			dht_bit_pointer=7;
			dht_byte_pointer++;
			if (dht_byte_pointer==4) {
				dht_data_ready=1;
				dht_byte_pointer = 0;
				dht_bit_pointer = 7;
//				dht_bit_position = 0;
			}
		}
		else {
			dht_bit_pointer--;
		}
	}

}

void TIM1_BRK_TIM15_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM15, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM15->CCR2;

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = ((TIM15->CCR1) * 100) / IC2Value;

    /* Frequency computation */
 //   Frequency = SystemCoreClock / IC2Value;
  }
  else
  {
    DutyCycle = 0;
    Frequency = 0;
  }



  // fill one more value of dht bits array
//  dht_bit_array[dht_bit_position]=TIM_GetCapture1(TIM15);
//  dht_bit_array[dht_bit_position]=DutyCycle;
//  dht_bit_position++;
//  dht_bit_array[dht_bit_position]=TIM15->CCR2;
  dht_bit_position++;		// holds current DHT response bit sequence number

	if (dht_bit_position>dht_shifter && dht_data_ready==0) {
		if (DutyCycle>25 && DutyCycle<35) {
			dht_data[dht_byte_pointer] &= ~(1<<(dht_bit_pointer));	// reset bit in dht_data[i]
		}
		else {
			dht_data[dht_byte_pointer] |= (1<<(dht_bit_pointer)); // set bit
		}
		if (dht_bit_pointer==0){
			dht_bit_pointer=7;
			dht_byte_pointer++;
			if (dht_byte_pointer==4) {
				dht_data_ready=1;
				dht_byte_pointer = 0;
				dht_bit_pointer = 7;
//				dht_bit_position = 0;
			}
		}
		else {
			dht_bit_pointer--;
		}
	}

}

#define MAX_SONAR_READ	400				// drop wrong reads
void TIM1_UP_TIM16_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM16 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM16, TIM_IT_CC1);

  /* Get the Input Capture value */
  if (TIM16->CNT < MAX_SONAR_READ) {
	  sonar_read[MIXTANK_SONAR] = TIM16->CNT;
  }
  TIM16->CNT = 0;
}

void TIM1_TRG_COM_TIM17_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM16 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM17, TIM_IT_CC1);
//  TIM17->SR &= ~TIM_SR_CC1IF;
  /* Get the Input Capture value */
  if (!(GPIOB->IDR & (1<<9)) && (TIM17->CNT < MAX_SONAR_READ)) {
	  sonar_read[FWTANK_SONAR]=SONAR1_TIM->CNT;
  }
  SONAR1_TIM->CNT = 0;
}


void dht_get_data(void){	// function starts getting data from DHT22 sensor
//	SONAR1_TIM->EGR |= TIM_EGR_CC1G;
	vTaskDelay(25);
	  uint8_t i;
	  for (i=0;i<5;i++) {
		dht_data[i]=0;
	  }
//	  dht_bit_ready = 0;
	  dht_bit_position = 0;
	  dht_data_ready=0;
	  dht_init_out();
	  DHT_0;
//	  GPIOA->BRR = (1<<DHT_TRIG_PLUG);		// set 0
	  vTaskDelay(5);
	  DHT_1;
	  dht_init();
	  vTaskDelay(200);

//	  dht_bit_ready = 1;
//	  dht_bit_position = 0;
//	  GPIOA->BSRR = (1<<DHT_TRIG_PLUG);	// set 1
	  vTaskDelay(5);
	  dht_conv_data();
}

void dht_conv_data(void){ // convert DHT impulse lengths array into numbers and strings of T and rH
	vTaskDelay(10);
	if (dht_data_ready==1) {

		vTaskDelay(10);

