plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void Delay_us(uint32_t delay){
	uint32_t del=delay*250; while (del--){}
}

/* uint16_t get_average_adc(uint8_t amount){
	uint8_t i=0;
	uint32_t sum = 0;
	for (i=0; i<amount; i++) {
		sum += JDR_BUTTONS;
	}
	return sum/amount;
} */

void buttonCalibration(void){	// buttons calibration function
	Lcd_clear();
	Lcd_goto(0,0);
//	Lcd_write_arr("no_sd=",5);
	no_sd+=48;
	Lcd_write_arr(no_sd,1);
//	run_valve_motor(0);
//	run_valve_motor(1);
//	Delay_us(100000);

	uint16_t button_val[4], diff;
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_arr("<", 1);
	Delay_us(30000);
	adcAverager();
	Delay_us(100);
//	uint16_t adcAverage[4];
	button_val[0] = adcAverage[ADC_AVG_BUTTONS];
	Lcd_goto(0,0);
	Lcd_write_arr("OK", 2);
	Delay_us(30000);
	adcAverager();
	Delay_us(100);
	button_val[1] = adcAverage[ADC_AVG_BUTTONS];
	Lcd_goto(0,0);
	Lcd_write_arr("CANCEL", 6);
	Delay_us(30000);
	adcAverager();
	Delay_us(100);
	button_val[2] = adcAverage[ADC_AVG_BUTTONS];
	Lcd_clear();
	Lcd_write_arr(">", 1);
	Delay_us(30000);
	adcAverager();
	Delay_us(100);
	button_val[3] = adcAverage[ADC_AVG_BUTTONS];

	if ((button_val[3]>>3)<(button_val[0]>>3)) {
		buttonReverse = 1;
	}
	else if ((button_val[3]>>3)>(button_val[0]>>3)) {
		buttonReverse = 0;
	}
	else {
		// loadButtonSettings();	// no key pressed, loading settings from EEPROM
		buttonReverse = 2;	//means loading button settings from EEPROM
	}
	if (buttonReverse == 0) {
		diff = ((button_val[1]-button_val[0])/2)-5;
		button_ranges[0] = (button_val[0]-diff/2);	// 05.09.13. NxtLn commented
//		button_ranges[0] = button_val[0]-diff;
		button_ranges[1] = button_val[0]+diff;
		button_ranges[2] = button_val[1]-diff;
		diff = ((button_val[2]-button_val[1])/2)-5;
		button_ranges[3] = button_val[1]+diff;
		button_ranges[4] = button_val[2]-diff;
		diff = ((button_val[3]-button_val[2])/2)-5;
		button_ranges[5] = button_val[2]+diff;
		button_ranges[6] = button_val[3]-diff;
		button_ranges[7] = (button_val[3]+diff/2); 	// 05.09.13. NxtLn commented
//		button_ranges[7] = button_val[3]+diff;
		saveButtonRanges();
	}
	else if (buttonReverse == 1) {
		diff = ((button_val[0]-button_val[1])/2)-5;
		button_ranges[0] = button_val[0]-diff;
		button_ranges[1] = button_val[0]+diff;
		button_ranges[2] = button_val[1]-diff;
		diff = ((button_val[1]-button_val[2])/2)-5;
		button_ranges[3] = button_val[1]+diff;
		button_ranges[4] = button_val[2]-diff;
		diff = ((button_val[2]-button_val[3])/2)-5;
		button_ranges[5] = button_val[2]+diff;
		button_ranges[6] = button_val[3]-diff;
		button_ranges[7] = button_val[3]+diff;
		saveButtonRanges();
	}
	else {
		Lcd_write_str("EEPROM buttons");
		readButtonRanges();
	}

	if (button_ranges[0]>button_ranges[8]) {
				buttonReverse=1;
	}
	Lcd_goto(0,0);
	Lcd_write_str("Complete");
}

void displayAdcValues(void){
#ifdef TEST_MODE
	uint8_t button=0;
	Lcd_clear();
	vTaskDelay(500);
	while (button!=BUTTON_OK){
		button=readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_digit(adcAverage[0]/100);
		Lcd_write_digit(adcAverage[0]);
		Lcd_write_str(" 2:");
		Lcd_write_digit(adcAverage[1]/100);
		Lcd_write_digit(adcAverage[1]);
		Lcd_goto(1,0);
		Lcd_write_str("3:");
		Lcd_write_digit(adcAverage[2]/100);
		Lcd_write_digit(adcAverage[2]);
		Lcd_write_str(" 4:");
		Lcd_write_digit(adcAverage[3]/100);
		Lcd_write_digit(adcAverage[3]);
		vTaskDelay(20);
	}
	Lcd_clear();
#endif
}

void displayAdcValues_bak(void){
#ifdef TEST_MODE
	uint8_t button=0;
	Lcd_clear();
	vTaskDelay(500);
	while (button!=BUTTON_OK){
		button=readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_digit(ADC1->JDR1/100);
		Lcd_write_digit(ADC1->JDR1);
		Lcd_write_str(" 2:");
		Lcd_write_digit(ADC1->JDR2/100);
		Lcd_write_digit(ADC1->JDR2);
		Lcd_goto(1,0);
		Lcd_write_str("3:");
		Lcd_write_digit(ADC1->JDR3/100);
		Lcd_write_digit(ADC1->JDR3);
		Lcd_write_str(" 4:");
		Lcd_write_digit(ADC1->JDR4/100);
		Lcd_write_digit(ADC1->JDR4);
		vTaskDelay(20);
	}
	Lcd_clear();
#endif
}

void display_usart_rx2(void){	// another usart test fr displaying RxBuffer contents
		uint8_t button=0, i=0;
		Lcd_clear();
		vTaskDelay(500);
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(RxBuffer[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(RxBuffer[5]);
			Lcd_write_8b(RxBuffer[6]);

			Lcd_write_str(" ");
			Lcd_write_digit(rxm_state);
			Lcd_write_digit(RxCounter);
			Lcd_write_digit(pb_pntr);
			Lcd_write_digit(packet_length);
			vTaskDelay(20);
		}
		Lcd_clear();
}

void display_usart_rx(void){
		uint8_t button=0, i=0;
		Lcd_clear();
		vTaskDelay(500);
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(RxBuffer[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(RxBuffer[5]);
			Lcd_write_8b(RxBuffer[6]);
			Lcd_write_str(" ");
//			Lcd_write_digit(RxCounter);
			Lcd_write_digit(rxm_state);
			copy_arr(&RxBuffer, &LCDLine2, 7,9);
//			Lcd_write_arr(&RxBuffer, 7);
			vTaskDelay(20);
		}
		Lcd_clear();
}

void display_usart_tx(void){
		uint8_t button=0, i=0;
		Lcd_clear();
		vTaskDelay(500);
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(TxBuffer[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(TxBuffer[5]);
			Lcd_write_8b(TxBuffer[6]);
			Lcd_write_str(" ");
			Lcd_write_digit(TxCounter);
			copy_arr(&TxBuffer, &LCDLine2, 7,9);
			vTaskDelay(20);
		}
		Lcd_clear();
}


void saveButtonRanges(void){
	uint8_t i;
	for (i=0; i<8; i++) {
		EE_WriteVariable(BUTTON_RANGES_START_ADDR+i, button_ranges[i]);
	}
}

void readButtonRanges(void){
	uint8_t i;
	for (i=0; i<8; i++) {
		EE_ReadVariable(BUTTON_RANGES_START_ADDR+i, &button_ranges[i]);
	}
}

