plantalog/cadi-gcl/stm32f100/grolly/current/main.c
				}
				if (plugType==255) {

				}
				else {
	//				if (plugStateFlag==1 && ((plugStateFlags2>>i)&1)==0) {
	//					plugStateSet(i, 1);	// enable plug
	//				}
	//				if (plugStateFlag==0 && ((plugStateFlags2>>i)&1)==1) {
	//					plugStateSet(i, 0);	// disable plug
	//				}
				}
				vTaskDelay(1);
			}
		}
		vTaskDelay(1);
#ifdef USE_VALVES
//		uint8_t valveId=0, valveMotorStateFlag=0;
//		for (valveId=0; valveId<3; valveId++) {
//			valveMotorStateFlag=valveMotorStateFlags&(1<<valveId);	// check if timer active now
//			valveMotorStateFlag>>=valveId;	// ostavit' toka flag
//			if (valveMotorStateFlag==1) {
//				valveMotorStateSet(valveId,1);
//			}
//			else {
//				valveMotorStateSet(valveId,2);
//			}
//		}
#endif
//		vTaskDelay(1);
//		valveManager();
		vTaskDelay(1);
		psiStab();
	}
}


void psiSetup(void){
	uint8_t curbutton=0, tmp;
	uint16_t curpsiadc=0, tmp2=0, tempvalue=0;
	comm_state=COMM_DIRECT_DRIVE;
	Lcd_clear();
//	Lcd_write_str("PSI pump load id");
//	EE_ReadVariable(PSI_PUMP_LOAD_ID, &tempvalue);
//	tempvalue = adjust8bit(tempvalue);
//	psi_pump_load_id = idSelector(1,4,tempvalue);
//	EE_WriteVariable(PSI_PUMP_LOAD_ID, psi_pump_load_id);
	tmp2 = EE_PLUG_SETTINGS+PSI_PUMP_ID;
	EE_WriteVariable(tmp2, 80);		// HARDCODE!!! program (timer) id for booster pump
	plugSettings[tempvalue] = 80;

//	psi_pump_load_id = idSelector(0,4,psi_pump_load_id);
//	tmp2 = (uint16_t)(psi_pump_load_id*0x00FF);
//	EE_WriteVariable(PSI_PUMP_LOAD_ID, tmp2);

	Lcd_write_str("ADC psi reading");
	while (curbutton!=BUTTON_FWD){
		Lcd_goto(1,0);
		Lcd_write_str("TOP:");
		if (curbutton==BUTTON_BCK){
			plugStateSet(PSI_PUMP_ID, 1);
		}
		if (curbutton==BUTTON_OK){
			plugStateSet(PSI_PUMP_ID, 0);
		}
		if (curbutton==BUTTON_CNL){
			psi_pump_top_level = adcAverage[AVG_ADC_PSI];
		}
		vTaskDelay(25);
		Lcd_write_16b(adcAverage[AVG_ADC_PSI]);
		Lcd_write_str("/");
		Lcd_write_16b(psi_pump_top_level);
		curbutton=readButtons();
	}
	plugStateSet(psi_pump_load_id, 0);
	printOk();
	curbutton=0;
	while (curbutton!=BUTTON_FWD){
		Lcd_goto(1,0);
		Lcd_write_str("BTM:");
		if (curbutton==BUTTON_BCK){
			plugStateSet(PSI_PUMP_ID, 1);
		}
		if (curbutton==BUTTON_OK){
			plugStateSet(PSI_PUMP_ID, 0);
		}
		if (curbutton==BUTTON_CNL){
			psi_pump_btm_level = adcAverage[AVG_ADC_PSI];
		}
		vTaskDelay(10);
		Lcd_write_16b(adcAverage[AVG_ADC_PSI]);
		Lcd_write_str("/");
		Lcd_write_16b(psi_pump_btm_level);
		curbutton=readButtons();
	}
	plugStateSet(PSI_PUMP_ID, 0);
	comm_state=COMM_MONITOR_MODE;
	EE_WriteVariable(PSI_SENSOR_TOP, psi_pump_top_level);
	EE_WriteVariable(PSI_SENSOR_BTM, psi_pump_btm_level);
	printOk();
}

void plugTest(void){
	uint8_t curplug=0, curbutton=0;
	comm_state=COMM_DIRECT_DRIVE;
	while (curbutton!=BUTTON_FWD){
		Lcd_goto(0,0);
		Lcd_write_str("Plug:");
		Lcd_write_digit(curplug);
		if (curbutton==BUTTON_BCK){
			curplug++;
			if (curplug==PLUG_AMOUNT) {
				curplug=0;
			}
		}
		if (curbutton==BUTTON_OK){
			plugStateSet(curplug, 1);
		}
		if (curbutton==BUTTON_CNL){
			plugStateSet(curplug, 0);
		}
		vTaskDelay(10);
		curbutton=readButtons();
	}
	comm_state=COMM_MONITOR_MODE;
}

void plugStateSet(uint8_t plug, uint8_t state){
//	if (PLUG_INVERT==1) {
//		state ^= (1<<0);
//	}
#ifdef GROLLY
	if (plug==0) {
		state = 1 - state;	// invert. PSI pump is "0" driven
	}
#endif
	if (state==1) {
		PLUG_DISABLE = (1<<plug);
		plugStateFlags2 |= (1<<plug);
	}
	else {
		PLUG_ENABLE = (1<<plug);
		plugStateFlags2 &= ~(1<<plug);
	}
}

void valveMotorStateSet(uint8_t valveId, uint8_t state){
#ifdef USE_VALVES
/*	if (state==1) {
//		VALVE_CTRL_PORT->BRR |= (1<<valveId+VALVE_MOTOR_GPIO_SHIFT); // valve enable 146%
			valveMotorStateFlags |= (1<<valveId);
			VALVE_ENABLE = (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
		}
		else {
			valveMotorStateFlags &= ~(1<<valveId);
			VALVE_DISABLE = (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
		} */
#endif
}



void EE_WriteWord(uint16_t Address, uint32_t Data){
	uint16_t tmp, tmp2;
	tmp2 = Data & 0xFFFF;
	tmp = Data >> 16;
	EE_WriteVariable(Address+1, tmp2);
	EE_WriteVariable(Address, tmp);
}

void programRunner(uint8_t programId){

	uint32_t tmp;
	uint8_t tmp8;
	Lcd_clear();
	switch (programId) {
	case 1:
		break;
	case 2:
		Lcd_write_str("Timer to adjust:");
		tmp8 = idSelector(1,4,1);
	    setTimer(--tmp8);
		break;
	case 3:
		plugTest();
		break;
	case 4:
		psiSetup();
		break;
	case 5:
		tmp = RTC_GetCounter();
		uint32_t unixtime = timeAdjust(tmp, 1);
		RTC_SetCounter(unixtime);
		Lcd_clear();
		break;
	case 6:
		Lcd_write_str("CTimer 2 adjust:");
		tmp8 = idSelector(1,4,1);
	    setCTimer(--tmp8);
		break;
	case 7:
//		setCTimer(1);
		break;
	case 8:
//		setCTimer(2);
		break;
	case 9:
		Lcd_write_str("Choose plug");
		tmp8 = idSelector(1,4,1);
		setPlug(--tmp8);	// decrement needed because of actual start from 0
		break;
	case 10:
//		setPlug(1);
		break;
	case 11:
//		setPlug(2);
		break;
	case 13:
		phMonSettings();
		break;
	case 14:
//		lightRangeSet();
		break;
	case 15:
		calibratePh();
		break;
	case 16:
		phStabSettings();
		break;
	case 17:
		dht_arr_displayer();
#ifdef	TEST_MODE
		displayAdcValues();	// test function to display ADC values
#endif
		display_usart_rx();
		display_usart_tx();
//		setDutyCycle();
		break;
	case 18:
		hygroStatSettings();
		break;
	case 19:
//		thermoStatSetup();
		break;
	case 20:
		valve_test();
		valve_test();
		break;
	case 21:
		watering_setup();
		break;
	case 22:
		fertilization_setup();
		break;
	case 23:
		get_water(0,0,100);
		//calibrateEc();
		break;
	case 24:
		// ecStabSettings();
		break;
	case 25:
		// buttonTest();
		break;
	case 26:
		// phAndEcTest();
		break;
	case 27:
		startWp();
		break;
	case 28:
		tankLevelStabSetup();
		break;
	}
}

/* void phStabSettings(void){
	Lcd_clear();
	Lcd_write_str("Set top lvl");
	readPhVal(value);
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);
	Lcd_write_str("Set bottom lvl");
	readPhVal(value);
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);

