plantalog/cadi-gcl/stm32f100/grolly/current/main.c
int yesNoSelector(char str, int curval){
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_str(str);
	vTaskDelay(50);
	uint8_t button=0;
	vTaskDelay(50);
	while (button!=BUTTON_OK) {
		if (button==BUTTON_FWD || button==BUTTON_BCK) {
/*			Lcd_goto(1,5);
			curval |= 1;
			vTaskDelay(50);
			if (curval==0){
				Lcd_write_str("< NO >");
			}
			vTaskDelay(50);
			if (curval==1){
				Lcd_write_str("< SI >");
			}
			vTaskDelay(50);
			button=readButtons();
			vTaskDelay(50); */
		}
		vTaskDelay(50);

	}
//	vTaskDelay(50);
	return(curval);
}

uint32_t timeAdjust(uint32_t cnt, uint8_t includeDays)
{
	Lcd_clear();
	uint32_t unixtime2;
	uint8_t button=0;
	RTC_DateTime curtime, curtime2;
	char unixtimestr[11];
	curtime=unix2DateTime(cnt);

	while (button!=BUTTON_FWD)
	{
		button=readButtons();
		if (button==BUTTON_BCK)
			{
				if (curtime.hour>22) {curtime.hour=0;}
				else {curtime.hour++;}
			}
		if (button==BUTTON_OK)
			{
				if (curtime.min>58) {curtime.min=0;}
				else {curtime.min++;}
			}
		if (button==BUTTON_CNL)
			{
				if (curtime.sec>58) {curtime.sec=0;}
				else {curtime.sec++;}
			}
    	vTaskDelay(5);
		Lcd_goto(0,0);
    	Lcd_write_digit(curtime.hour);
    	Lcd_write_str(":");
    	Lcd_write_digit(curtime.min);
    	Lcd_write_str(":");
    	Lcd_write_digit(curtime.sec);
#ifdef	TEST_MODE
		unixtime2=DateTime2unix(curtime);
		curtime2=unix2DateTime(unixtime2);
    	int32str(unixtime2, &unixtimestr);
		Lcd_goto(0,10);
    	Lcd_write_digit(curtime2.hour);
    	Lcd_write_digit(curtime2.min);
    	Lcd_write_digit(curtime2.sec);
    	Lcd_goto(1,2);
    	vTaskDelay(5);
    	copy_arr(&unixtimestr, LCDLine2, 10, 2);
#endif
    	vTaskDelay(20);
	}
	button=0;
	printOk();
	if (includeDays==1) {
			while (button!=BUTTON_FWD)
				{
					button=readButtons();
					if (button==BUTTON_CNL)
						{
							if (curtime.year>50) {curtime.year=12;}
							else {curtime.year++;}
						}
					if (button==BUTTON_OK)
						{
							if (curtime.month>11) {curtime.month=1;}
							else {curtime.month++;}
						}
					if (button==BUTTON_BCK)
						{
							if (curtime.day>30) {curtime.day=1;}
							else {curtime.day++;}
						}

			    	vTaskDelay(5);
#ifdef	TEST_MODE
			    	// preobrazovanija tuda-sjuda dlja togo chtoby ubeditsja, chto funkcii rabotajut verno
					unixtime2=DateTime2unix(curtime);
					curtime2=unix2DateTime(unixtime2);
			    	int32str(unixtime2, &unixtimestr);
#endif
			    	//Lcd_clear();
			    	vTaskDelay(5);
					Lcd_goto(0,0);
			    	Lcd_write_digit(curtime.day);
			    	Lcd_write_str("-");
			    	Lcd_write_digit(curtime.month);
			    	Lcd_write_str("-");
			    	Lcd_write_digit(curtime.year);
			    	vTaskDelay(5);
#ifdef	TEST_MODE
					Lcd_goto(0,10);
			    	Lcd_write_digit(curtime2.day);
			    	Lcd_write_digit(curtime2.month);
			    	Lcd_write_digit(curtime2.year);
			    	vTaskDelay(5);
			    	copy_arr(&unixtimestr, LCDLine2, 10, 2);
#endif
					vTaskDelay(50);
			}
		}
	else {
		unixtime2 = 0;
		unixtime2 += curtime.hour*3600;
		unixtime2 += curtime.min*60;
		unixtime2 += curtime.sec;
	}
	printOk();
	return(unixtime2);
}

void Lcd_write_arr2(uc8 *STRING, uint8_t chars)
{
	char c;
	uint8_t i;
	for (i=0; i<chars; i++) {
		c=STRING[i];
//		vTaskDelay(5);
		Lcd_write_data(c);
	}
}

void Lcd_write_arr(uc8 *STRING, uint8_t chars)
{
	char c;
	uint8_t i;
	for (i=0; i<chars; i++) {
		c=STRING[i];
		Lcd_write_data(c);
	}
}




RTC_DateTime unix2DateTime(uint32_t unixtime)
{
	RTC_DateTime datetime;
	uint32_t tmp;
	uint8_t leaps, month, day;
	uint16_t daysFromLeap, dayOfYearLeaped;
	tmp = unixtime-YEAR12SECS;	// vse raschety vedutsja ot 01.01.2012 00:00:00

	datetime.sec = unixtime % 60;
	unixtime /= 60;
	datetime.min = unixtime % 60;
	unixtime /= 60;
	datetime.hour = unixtime % 24;
	tmp /= 86400;
	daysFromLeap = tmp % 1461;	// 86400*1461=126230400 secs in leap cycle
	leaps=tmp/1461;
	daysFromLeap++;

	if (daysFromLeap<59)	// 1..60
	{
		datetime.year=leaps*4+12;
		dayOfYearLeaped=daysFromLeap+1;	// for shifting days because of 29.03

	}
	if (daysFromLeap>=59 && daysFromLeap<=366)		// 61..366
	{
		datetime.year=leaps*4+(daysFromLeap-1)/365+12;
		dayOfYearLeaped=daysFromLeap;
	}
	if (daysFromLeap>=366) {								// 367..1461
		datetime.year=leaps*4+(daysFromLeap-1)/365+12;
		dayOfYearLeaped=((daysFromLeap-366) % 365)+1;
	}

	if (dayOfYearLeaped>=1 && dayOfYearLeaped<=31)
	{
		month=1;	// january
		day=dayOfYearLeaped;
	}
	if (dayOfYearLeaped>=32 && dayOfYearLeaped<=59)
	{
		month=2;	// february
		day=dayOfYearLeaped-31;
	}
	if (dayOfYearLeaped>=60 && dayOfYearLeaped<=90)
	{
		month=3;	// march
		day=dayOfYearLeaped-59;
	}
	if (dayOfYearLeaped>=91 && dayOfYearLeaped<=120)
	{
		month=4;	// april
		day=dayOfYearLeaped-90;
	}
	if (dayOfYearLeaped>=121 && dayOfYearLeaped<=151)
	{
		month=5;	// may
		day=dayOfYearLeaped-120;
	}
	if (dayOfYearLeaped>=152 && dayOfYearLeaped<=181)
	{
		month=6;	// june
		day=dayOfYearLeaped-151;
	}
	if (dayOfYearLeaped>=182 && dayOfYearLeaped<=212)
	{
		month=7;	// july
		day=dayOfYearLeaped-181;
	}
	if (dayOfYearLeaped>=213 && dayOfYearLeaped<=243)
	{
		month=8;	// august
		day=dayOfYearLeaped-212;
	}
	if (dayOfYearLeaped>=244 && dayOfYearLeaped<=273)
	{
		month=9;	// september
		day=dayOfYearLeaped-243;
	}
	if (dayOfYearLeaped>=274 && dayOfYearLeaped<=304)
	{
		month=10;	// october
		day=dayOfYearLeaped-273;
	}
	if (dayOfYearLeaped>=305 && dayOfYearLeaped<=334)
	{
		month=11;	// november
		day=dayOfYearLeaped-304;
	}
	if (dayOfYearLeaped>=335 && dayOfYearLeaped<=365)
	{
		month=12;	// december
		day=dayOfYearLeaped-334;
	}
	datetime.day=day;
	datetime.month=month;
	if (daysFromLeap==59) {
		datetime.day=29;
		datetime.month=2;
	}
	return(datetime);
}

uint32_t DateTime2unix(RTC_DateTime datetime)
{
	    uint32_t tmp;
///	    uint8_t i;
	    uint16_t days, dayFromYear;

	    switch (datetime.month) {
	    case 0:
	    	days=0;
	    case 1:
	    	days=0;
	    	break;
	    case 2:
	    	days=31;
	    	break;
	    case 3:
	    	days=59;
	    	break;
	    case 4:
	    	days=90;
	    	break;
	    case 5:
	    	days=120;
	    	break;
	    case 6:
	    	days=151;
	    	break;
	    case 7:
	    	days=181;
	    	break;
	    case 8:
	    	days=212;
	    	break;
	    case 9:
	    	days=243;
	    	break;
	    case 10:
	    	days=273;
	    	break;
	    case 11:
	    	days=304;
	    	break;
	    case 12:
	    	days=334;
	    	break;
	    }

