plantalog/cadi-gcl/stm32f100/grolly/current/main.c
	  GPIOA->CRL   &= ~GPIO_CRL_MODE2;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF2;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE3;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF3;

//	  GPIOA->CRL   &= ~GPIO_CRL_MODE4;
//	  GPIOA->CRL   &= ~GPIO_CRL_CNF4;

	  RCC->APB2ENR |=  RCC_APB2ENR_ADC1EN;
	  RCC->CFGR    &= ~RCC_CFGR_ADCPRE;
	  ADC1->CR1     =  0;
	  ADC1->CR2    |=  ADC_CR2_CAL;
	  while (!(ADC1->CR2 & ADC_CR2_CAL)){};
	  ADC1->CR2     =  ADC_CR2_JEXTSEL;
	  ADC1->CR2    |=  ADC_CR2_JEXTTRIG;
	  ADC1->CR2    |=  ADC_CR2_CONT;
	  ADC1->CR1    |=  ADC_CR1_SCAN;
	  ADC1->CR1    |=  ADC_CR1_JAUTO;
	  ADC1->JSQR    =  (uint32_t)(4-1)<<20;
	  ADC1->JSQR   |=  (uint32_t)1<<(5*0);
	  ADC1->JSQR   |=  (uint32_t)2<<(5*1);
	  ADC1->JSQR   |=  (uint32_t)3<<(5*2);
	  ADC1->JSQR   |=  (uint32_t)4<<(5*3);
	  ADC1->SMPR1  |=	0x00FFFFFF;
	  ADC1->CR2    |=  ADC_CR2_ADON;
	  ADC1->CR2    |=  ADC_CR2_JSWSTART;
}

void Lcd_write_digit2(uint8_t numb){
	if (numb<10) {
		Lcd_write_data(48);
		Lcd_write_data(48+numb);
	}
	else {
		Lcd_write_data((numb/10)+48);
		Lcd_write_data((numb-(numb/10)*10)+48);
	}
}

void Lcd_write_digit(uint8_t numb){
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine1[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
	else {
		LCDLine2[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine2[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
}





void prvSetupHardware()
{

	// LOAD triggering control pins init
	RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;     // Enable clock on GPIOC.
//	        GPIOC->CRH      &= ~GPIO_CRH_CNF8;              //  Push-Pull. LED PC8
//	        GPIOC->CRH      &= ~GPIO_CRH_CNF9;              //  Push-Pull. LED PC9
	        GPIOC->CRL      &= ~GPIO_CRL_CNF0;		// LOAD triggering from PC0...
	        GPIOC->CRL      &= ~GPIO_CRL_CNF1;
	        GPIOC->CRL      &= ~GPIO_CRL_CNF2;
	        GPIOC->CRL      &= ~GPIO_CRL_CNF3;		// ... to PC3


//	        GPIOC->CRH   |= GPIO_CRH_MODE8_0;       //  10MHz.
	        GPIOC->CRL   |= GPIO_CRL_MODE0_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE1_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE2_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE3_0;



}


void vTaskLCDdraw(void *pvParameters) {	// draws lcd
//	uint32_t tmp=0;
//	int str;
	for (;;) {
		vTaskSuspendAll();
		Lcd_write_cmd(0x80);	// lcd_goto(0,0)
//		Lcd_goto(0,0);
		Lcd_write_arr(&LCDLine1, 16);
//		xTaskResumeAll();
//		vTaskDelay(15);
//		vTaskSuspendAll();
		Lcd_write_cmd(0x80+0x40);	// lcd_goto(1,0)
		Lcd_write_arr(&LCDLine2, 16);
		xTaskResumeAll();
		vTaskDelay(17);
	}
}


void int32str(uint32_t d, char *out)
{
    out[10] = '\0';
    out[9] = '0' + ( d       )    % 10;
    out[8] = '0' + ( d /= 10 )    % 10;
    out[7] = '0' + ( d /= 10 )    % 10;
    out[6] = '0' + ( d /= 10 )    % 10;
    out[5] = '0' + ( d /= 10 )    % 10;
    out[4] = '0' + ( d /= 10 )    % 10;
    out[3] = '0' + ( d /= 10 )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
//    return out;
}

void int10str(uint32_t d, char *out)
{
    out[4] = '\0';
    out[3] = '0' + ( d       )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
//    return out;
}

uint32_t EE_ReadWord(uint16_t Address){
	uint16_t tmp=0, tmp2=0;
	uint32_t Data = 0;
	EE_ReadVariable(Address, &tmp);
	EE_ReadVariable(Address+1, &tmp2);
	Data = ((uint32_t)tmp << 16) + (uint32_t)tmp2;
	return Data;
}

void flush_lcd_buffer(void){
	uint8_t i=0;
	for (i=0;i<16;i++){
		LCDLine1[i]=32;
		LCDLine2[i]=32;
	}
}

void setPwmDc(uint8_t duty_cycle){		// duty_cycle in %
	TIM3->CCR3 = duty_cycle*10;
	TIM3->CCR4 = 1000 - duty_cycle*10;
}

void setDoserSpeed(uint8_t doser, uint8_t speed){
	uint16_t spd=0;
	uint32_t speeds1=0, speeds2=0;
	speeds1 = EE_ReadWord(DOSER_SPEEDS);
	if (doser==0) {
		TIM3->CCR1 = (100-speed)*10;
		speeds2 = (speeds1&0xFFFFFF00)|speed;
	}
	if (doser==1) {
		TIM3->CCR2 = (100-speed)*10;
		speeds2 = (speeds1&0xFFFF00FF)|(speed<<8);
	}
	if (doser==2) {
		TIM3->CCR3 = (100-speed)*10;
		speeds2 = (speeds1&0xFF00FFFF)|(speed<<16);
	}
	if (doser==3) {
		TIM3->CCR4 = (100-speed)*10;
		speeds2 = (speeds1&0xFFFFFF)|(speed<<24);
	}
	EE_WriteWord(DOSER_SPEEDS, speeds2);
}

void setDutyCycle(void){
	uint8_t button=0, duty_cycle;
	duty_cycle = TIM3->CCR3/10;
	Lcd_clear();
	while (button!=BUTTON_OK) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("Crnt duty cycle");
		Lcd_goto(1,0);
		Lcd_write_digit(duty_cycle);
		if (button==BUTTON_FWD) {
			if (duty_cycle==99) {
			}
			else {
				duty_cycle++;
				setPwmDc(duty_cycle);
			}
		}
		if (button==BUTTON_BCK) {
			if (duty_cycle==0) {
			}
			else {
				duty_cycle--;
				setPwmDc(duty_cycle);
			}
		}
		vTaskDelay(20);
	}
	Lcd_clear();
}

void test_grolly_hw(void){
	uint32_t i2 = 0;
	uint32_t i=0;
	Lcd_clear();
	Lcd_write_arr("Checking systems", 16);

	for (i=0; i<5;i++){
		close_valve(i);
		for (i2=0;i2<200000;i2++) {

		}
	}


	for (i=0; i<5;i++){
		open_valve(i);
		for (i2=0;i2<200000;i2++) {

		}
	}
	for (i2=0;i2<1000000;i2++) {

	}
	for (i=0; i<5;i++){
		close_valve(i);
		for (i2=0;i2<1000000;i2++) {

		}
	}
	for (i=0; i<5;i++){
		open_valve(i);
		for (i2=0;i2<200000;i2++) {

		}
	}

	for (i=0; i<5;i++){
		close_valve(i);
		for (i2=0;i2<200000;i2++) {

		}
	}

	for (i=0;i<4;i++) {
		enable_dosing_pump(i,1);	// startup disable dosing pumps
		for (i2=0;i2<1000000;i2++) {

		}
		enable_dosing_pump(i,0);	// startup disable dosing pumps
	}

}

int main(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA |RCC_APB2Periph_AFIO, ENABLE);
	// VALVE control pins init
	GPIO_InitTypeDef init_pin;
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
 	init_pin.GPIO_Pin  = GPIO_Pin_8 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &init_pin);
	// EOF VALVE INIT

	SystemInit();

	uint32_t i;
	dosing_motor_control_init();
	for (i=0;i<4;i++) {
		enable_dosing_pump(i,0);	// startup disable dosing pumps
	}
	/* Unlock the Flash Program Erase controller */
	FLASH_Unlock();
	/* EEPROM Init */
	EE_Init();
	AdcInit();
//	dht_init();
	RtcInit();		//init real time clock

	fup_time = RTC_GetCounter();
	auto_failures = 0;
	// SOLENOID VALVE RE-INIT
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
 	init_pin.GPIO_Pin  =  GPIO_Pin_8 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &init_pin);
	// EOF SOLENOID VALVE RE-INIT

